package pres.auxiliary.tool.word;

/**
 * 该枚举规定了产生随机字符串时所需要的模型
 * 
 * @author 彭宇琦
 * @version Ver1.1.3
 */
public enum StringMode {
	/**
	 * 向字符串池中添加数字0-9
	 */
	NUM("0123456789"),

	/**
	 * 向字符串池中添加所有大写字母
	 */
	CAP("ABCDEFGHIJKLMNOPQRSTUVWXYZ"),

	/**
	 * 向字符串池中添加所有小写字母
	 */
	LOW("abcdefghijklmnopqrstuvwxyz"),

	/**
	 * 向字符串池中添加数字、大写字母以及小写字母
	 */
	ALL("abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789"),

	/**
	 * 向字符串池中添加地区名称缩写
	 */
	AREA("京津冀晋蒙辽吉黑沪苏浙皖闽赣鲁豫鄂湘粤桂琼渝川贵云藏陕甘青宁新"),

	/**
	 * 用于生成部分姓氏（无法生成两个字的姓氏）
	 */
	SURNAME("赵钱孙李周吴郑王冯陈褚卫蒋沈韩杨朱秦尤许何吕施张孔曹严华金魏陶姜戚谢邹喻柏水窦章云苏潘葛奚范彭郎鲁韦昌马苗凤花方俞任"
			+ "袁柳酆鲍史唐费廉岑薛雷贺倪汤滕殷罗毕郝邬安常乐于时傅皮卞齐康伍余元卜顾孟平黄和穆萧尹姚邵湛汪祁毛禹狄米贝明臧计伏成戴"
			+ "谈宋茅庞熊纪舒屈项祝董梁杜阮蓝闵席季麻强贾路娄危江童颜郭梅盛林刁钟徐邱骆高夏蔡田樊胡凌霍虞万支柯昝管卢莫经房裘缪干解"
			+ "应宗丁宣贲邓郁单杭洪包诸左石崔吉钮龚程嵇邢滑裴陆荣翁荀羊於惠甄曲家封芮羿储靳汲邴糜松井段富巫乌焦巴弓牧隗山谷车侯宓蓬"
			+ "全郗班仰秋仲伊宫宁仇栾暴甘钭厉戎祖武符刘景詹束龙叶幸司韶郜黎蓟薄印宿白怀蒲邰从鄂索咸籍赖卓蔺屠蒙池乔阴鬱胥能苍双闻莘"
			+ "党翟谭贡劳逄姬申扶堵冉宰郦雍卻璩桑桂濮牛寿通边扈燕冀郏浦尚农温别庄晏柴瞿阎充慕连茹习宦艾鱼容向古易慎戈廖庾终暨居衡步"
			+ "都耿满弘匡国文寇广禄阙东欧殳沃利蔚越夔隆师巩厍聂晁勾敖融冷訾辛阚那简饶空曾毋沙乜养鞠须丰巢关蒯相查后荆红游竺权逯盖益桓公"),

	/**
	 * 用于生成部分汉字。注意，该方法会将1000个汉字放入字符串种子中
	 */
	CH("早晨我推开窗一阵寒风迎面吹来使不禁打了个颤刺骨的已经没有秋凉爽外世界中足迹逐渐淡去对冷在心默地说别天年四季过冬可避免节各利弊谈" +
			"上喜爱也道厌倦万物复苏春烈日当空夏诗情画意冰清玉洁似乎都那么美好但骄阳太猛无是比起桃花簇主更偏霜叶红于二月而还未向大告" +
			"就匆走多少些留念披衣寻找所下点滴痕出家门远望见楼房旁银杏树小跑到它身寥几光秃枝干往生机及昔丽记得前片扇子般挂满头边缘镶" +
			"条由翠绿慢渡黄色像笔水粉偶尔金晃悠落如飞舞蝴蝶让人怜悯今儿全营养良孩瑟发抖许木本依恋愿飘轻摘握手掌温度感暖松紧随棵睡妈" +
			"脚准备着明重归根继续后块暗藏给死气沉末初增添抬瞭眼睁只朝西现样蓝批灰纱忽然想句调皮话语原为涂这嘴角翘真放伤久令神胜曾著" +
			"名老练处理难看深厚绘功底要你顶幅立即黯失自位杰尘莫再长白山池湖种法用言形容并晴里称碧洗正因朵云彩才加果把做棉袄定很赞扬" +
			"古词量墨能梦境消蒙惋惜蔚突停住步棕褐粗壮约碗口细豆惊最吗忆藤蔓仿佛穿越两每周补课时叫字团毛绒哪野薄毯拾够巴躺涯何娇嫩流" +
			"谢虽讨命却此短暂便抵挡纷梅坚强注香断谁叹林黛残靠回又凄怀刻总舍己亲朋友印响期待她次降临送东必追华结奇怪静坐逝事担保十之" +
			"八九败冒恍惚瞬间与历或拥实合钥匙确插入锁会潮涌进脑海任兴成连接桥梁以麦浪稻田离路延候忍和爷奶活学五级切懵懂第缕鹿尽力欢" +
			"拉表妹翻岭翔姿势奔们玩甚至忘晚他略带沙哑嗓音半腰亭唤喊快夕晕瘦衬托伛偻衫蛀虫习惯性证存同线纽扣觉笑辈持新三旧缝勤俭信吧" +
			"退休部观照闲安忙碌滔绝一概纪故絮叨代脱轨选择作耳乡耐式电吱呀声疼喝暴晒枯植急需源系吸收分躲敢被帮其工极易河泵行辛苦拿管" +
			"从喂渴禾苗灼热背硬铜汗液淌湿蜻蜓斗笠歇视谓耕耘获等饱谷始洋溢穗芳悦催促拨割联唠拖毕竟器仔袋塞塑料漏网鱼刚扎腿刮踩软泥黏" +
			"糊麻蹿蛤蟆跳拍差抱怨算捡反破啊丝眉纠脸严肃伙饭吃粒米费锄午土哎篇论示王鼎钧文写密市灯昼街攒动挤掉鞋刷遗隙珍贵喧嚣繁拙唯" +
			"宁村听烦城嘈杂闻腻呛烟青郭斜墟穷巷牛羊圣慵懒七站终伴脆啼醒颉取束曦传膜哞庄床逢集漱完赶童乐吵嚷糖葫芦公百赖婆则挑件裙趣" +
			"摊占置特产品讲究摆整稀疏央吆夹价弥漫爆味邻互相招呼揽姑娘服堆铺派闹非寞屋眺油蚂蚱隐座虚缥缈遮掩害羞维赋霭千佳涉目低顺卑" +
			"躬屈膝羁狂格群苍欲虬峥嵘尺寸泓石映峰亦景怎泉幽妙峭壁应盈倒倚溪叠瀑奏鸟鸣赏傍散径农丰草帽肩搭巾擦珠悄渗昏限近荏苒惆怅余" +
			"捉螃蟹顿致桶筒趁黑高夜堪媲洌鉴犹柔滑锦缎缠绕澈透亮稍横者踪影露张豫逃灵敏伸逮翼抓劝捏错方钳饶哦扔瓣旋将精常番含义迫广陪" +
			"娑浩瀚宇宙星颗微渺唉岁知愁滋领宝熟若诉弱北啸雪盛傲闪烁眸吻誓弃护永守份诺煎熬睹采勇逸缱绻蹈献伦宴唱曲晶莹纯息歌潇茫席卷" +
			"求平颊吴侬内甜蜜痴抚摸陶醉融化艳绵封窒胶漆火交胸措燃烧窝执止绽荡漾男女校羽佯装仅充汉质彬雅转呵慰躁润芽抽模苞怒体什顾遇" +
			"彼宣犀罗曼蒂克烂棱乃君造设独钟铸杨唐婉悲雨改变李先夫国亡值泽慧困牺牲乱铭血畏惧浓超魂")

	;

	private String seed;

	private StringMode(String seed) {
		this.seed = seed;
	}

	/**
	 * 返回字符串种子
	 * @return 字符串种子
	 */
	public String getSeed() {
		return seed;
	}
}
